app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `salt`, `crypted_password`, `created_at`, `updated_at`) VALUES ('sree@c.co', 'xkkb4nW6zWGdVZJFTxSi', '$2a$10$RE0Tr2Cx2QNHPyu7YXLK8.COoPrGrg/fuBttS/8kKRIBOZBsUHzg.', '2015-02-11 06:45:05.884263', '2015-02-11 06:45:05.884263')
---
def create
  @user = User.new(user_params)
  if @user.save